In [1]:
import pandas as pd

## Series 생성

In [2]:
member = pd.Series(['홍길동','전우치','강감찬','스티브잡스'])

In [3]:
member

0      홍길동
1      전우치
2      강감찬
3    스티브잡스
dtype: object

In [6]:
member = pd.Series(['홍길동','전우치','강감찬','스티브잡스'],
                  index=['1번','2번','3번','4번'])

In [7]:
member

1번      홍길동
2번      전우치
3번      강감찬
4번    스티브잡스
dtype: object

In [10]:
# Dicitionary 유형으로 생성
sal_1 = {'홍길동':100,'임꺽정':130,'전우치':120}

In [11]:
sal_2 = pd.Series(sal_1)

In [12]:
sal_2

홍길동    100
임꺽정    130
전우치    120
dtype: int64

## Series 조회 활용

In [ ]:
member[1]

In [13]:
member['1번']

'홍길동'

In [14]:
member[['1번','3번']]

1번    홍길동
3번    강감찬
dtype: object

## Series 연산방법

In [15]:
sal_3 = {'홍길동':10,'전우치' : 12, '강감찬':100}

In [16]:
sal_4 = pd.Series(sal_3)

In [17]:
print(sal_2 + sal_4)

강감찬      NaN
임꺽정      NaN
전우치    132.0
홍길동    110.0
dtype: float64

## DataFrame 생성

In [18]:
member3 = {'번호' : ['1번','2번','3번'],
           '이름' : ['홍길동','전우치','강감찬'],
           '생일' : [1975,1996,2000]}

In [19]:
member4 = pd.DataFrame(member3)

In [20]:
member4

   번호   이름    생일
0  1번  홍길동  1975
1  2번  전우치  1996
2  3번  강감찬  2000

In [21]:
# 컬럼 순서 지정
member5 = pd.DataFrame(member3, columns=['번호','생일','이름'])

In [22]:
member5

   번호    생일   이름
0  1번  1975  홍길동
1  2번  1996  전우치
2  3번  2000  강감찬

## DataFrame 조회

In [23]:
member5['생일']

0    1975
1    1996
2    2000
Name: 생일, dtype: int64

In [25]:
member5[['이름','생일']]

    이름    생일
0  홍길동  1975
1  전우치  1996
2  강감찬  2000

In [26]:
member5

   번호    생일   이름
0  1번  1975  홍길동
1  2번  1996  전우치
2  3번  2000  강감찬

In [27]:
# 1. 행번호를 지정하여 조회
member5.loc[0]

번호      1번
생일    1975
이름     홍길동
Name: 0, dtype: object

In [28]:
# 2. 원하는 조건에 맞는 데이터만 조회
member5.loc[member5['번호']>='2번']

   번호    생일   이름
1  2번  1996  전우치
2  3번  2000  강감찬

In [29]:
member6 = {'번호' : ['1번', '2번','3번','4번','5번'],
           '이름' : ['홍길동','전우치','강감찬','일지매','임꺽정'],
           '매출' : [100,200,250,300,150]}

In [30]:
member7 = pd.DataFrame(member6)

In [31]:
# 조건 : 매출이 100이상 200이하
member7.loc[(member7['매출']>=100) & (member7['매출']<=200)]

   번호   이름   매출
0  1번  홍길동  100
1  2번  전우치  200
4  5번  임꺽정  150

## 행과 열을 추가하는 방법

In [32]:
member8 = pd.DataFrame(member5, columns=['번호','이름','생일','지역'])

In [33]:
member8

   번호   이름    생일  지역
0  1번  홍길동  1975 NaN
1  2번  전우치  1996 NaN
2  3번  강감찬  2000 NaN

In [34]:
member8['지역']=['서울','부산','대구']

In [35]:
member8

   번호   이름    생일  지역
0  1번  홍길동  1975  서울
1  2번  전우치  1996  부산
2  3번  강감찬  2000  대구

In [42]:
member8.loc[3] = ['4번', '손흥민',1991,'서울']

In [43]:
member8

   번호   이름    생일  지역
0  1번  홍길동  1975  서울
1  2번  전우치  1996  부산
2  3번  강감찬  2000  대구
3  4번  손흥민  1991  서울

## 행/열 삭제하는 방법

In [44]:
member8.drop([0])

   번호   이름    생일  지역
1  2번  전우치  1996  부산
2  3번  강감찬  2000  대구
3  4번  손흥민  1991  서울

In [45]:
# 조건
member8.drop(member8[member8['생일']>1995].index)

   번호   이름    생일  지역
0  1번  홍길동  1975  서울
3  4번  손흥민  1991  서울